Merge pull request #4 from Atom-oh/feature/i18n-migration
Feature/i18n migration
